#ifndef ACS_HW1_POLAR_H
#define ACS_HW1_POLAR_H

//------------------------------------------------------------------------------
// polar.h - содержит описание полярного числа и его интерфейса
//------------------------------------------------------------------------------

#include "rnd.h"
#include <stdbool.h>
#include <stdio.h>

// Подсчёт значения полярного числа.
double p_cast (void *me);

// Вывод параметров полярного числа в файл
bool p_Out (void *me, FILE *fp);

// Ввод параметров полярного числа из файла
int p_In(void *p, FILE *fp);

// Ввод случайных параметров полярного числа
bool p_InRnd(void *p);

#endif //ACS_HW1_POLAR_H
